Revit 2027 API
LightFamily Properties
The LightFamily type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace